[Killed] BlockStatement
src/lib/emissions.js:17:63
  * @returns {{ gPerKm: number, label: string, kind: "carModel"|"mode" }}
  * @throws {Error} if transport is unknown or carModel is not found
  */
-export function getEmissionFactor(transport, carModel = null) {
-  if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car")
-    const row = CAR_MODELS.find((c) => c.model === carModel)
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`)
-    return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
-  }
-
-  if (!(transport in TRANSPORT_G_PER_KM)) {
-    throw new Error(`Unknown transport mode: "${transport}"`)
-  }
-
-  const g = TRANSPORT_G_PER_KM[transport]
-  return { gPerKm: g, label: transport, kind: "mode" }
-}
+export function getEmissionFactor(transport, carModel = null) {}
 
 /**
killedBy: getEmissionFactor non-car transport modes returns 0 g/km for foot
statusReason: Cannot read properties of undefined (reading 'gPerKm')

[Killed] ConditionalExpression
src/lib/emissions.js:18:7
  * @throws {Error} if transport is unknown or carModel is not found
  */
 export function getEmissionFactor(transport, carModel = null) {
-  if (transport === "car") {
+  if (true) {
     if (!carModel) throw new Error("carModel is required when transport is car")
     const row = CAR_MODELS.find((c) => c.model === carModel)
killedBy: getEmissionFactor non-car transport modes returns 0 g/km for foot
statusReason: carModel is required when transport is car

[Killed] BlockStatement
src/lib/emissions.js:18:28
  * @throws {Error} if transport is unknown or carModel is not found
  */
 export function getEmissionFactor(transport, carModel = null) {
-  if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car")
-    const row = CAR_MODELS.find((c) => c.model === carModel)
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`)
-    return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
-  }
+  if (transport === "car") {}
 
   if (!(transport in TRANSPORT_G_PER_KM)) {
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown transport mode: "car"

[Killed] ConditionalExpression
src/lib/emissions.js:19:9
  */
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car")
+    if (true) throw new Error("carModel is required when transport is car")
     const row = CAR_MODELS.find((c) => c.model === carModel)
     if (!row) throw new Error(`Unknown car model: "${carModel}"`)
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: carModel is required when transport is car

[Killed] ConditionalExpression
src/lib/emissions.js:19:9
  */
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car")
+    if (false) throw new Error("carModel is required when transport is car")
     const row = CAR_MODELS.find((c) => c.model === carModel)
     if (!row) throw new Error(`Unknown car model: "${carModel}"`)
killedBy: getEmissionFactor invalid inputs throws when transport is car but no carModel given
statusReason: expected [Function] to throw error including 'carModel is required' but got 'Unknown car model: "null"'

[Killed] ConditionalExpression
src/lib/emissions.js:20:40
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car")
-    const row = CAR_MODELS.find((c) => c.model === carModel)
+    const row = CAR_MODELS.find((c) => false)
     if (!row) throw new Error(`Unknown car model: "${carModel}"`)
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown car model: "Volkswagen Golf"

[Killed] EqualityOperator
src/lib/emissions.js:20:40
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car")
-    const row = CAR_MODELS.find((c) => c.model === carModel)
+    const row = CAR_MODELS.find((c) => c.model !== carModel)
     if (!row) throw new Error(`Unknown car model: "${carModel}"`)
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: expected 175 to be 180 // Object.is equality

[Killed] BooleanLiteral
src/lib/emissions.js:21:9
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car")
     const row = CAR_MODELS.find((c) => c.model === carModel)
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`)
+    if (row) throw new Error(`Unknown car model: "${carModel}"`)
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
   }
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown car model: "Volkswagen Golf"

[Killed] ConditionalExpression
src/lib/emissions.js:21:9
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car")
     const row = CAR_MODELS.find((c) => c.model === carModel)
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`)
+    if (true) throw new Error(`Unknown car model: "${carModel}"`)
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
   }
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown car model: "Volkswagen Golf"

[Killed] ObjectLiteral
src/lib/emissions.js:22:12
     if (!carModel) throw new Error("carModel is required when transport is car")
     const row = CAR_MODELS.find((c) => c.model === carModel)
     if (!row) throw new Error(`Unknown car model: "${carModel}"`)
-    return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
+    return {}
   }
 
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: expected undefined to be 180 // Object.is equality

[Killed] BlockStatement
src/lib/emissions.js:25:43
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
   }
 
-  if (!(transport in TRANSPORT_G_PER_KM)) {
-    throw new Error(`Unknown transport mode: "${transport}"`)
-  }
+  if (!(transport in TRANSPORT_G_PER_KM)) {}
 
   const g = TRANSPORT_G_PER_KM[transport]
killedBy: getEmissionFactor invalid inputs throws on unknown transport mode
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/emissions.js:25:7
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" }
   }
 
-  if (!(transport in TRANSPORT_G_PER_KM)) {
+  if (transport in TRANSPORT_G_PER_KM) {
     throw new Error(`Unknown transport mode: "${transport}"`)
   }
killedBy: getEmissionFactor non-car transport modes returns 0 g/km for foot
statusReason: Unknown transport mode: "foot"

[Killed] ObjectLiteral
src/lib/emissions.js:30:10
   }
 
   const g = TRANSPORT_G_PER_KM[transport]
-  return { gPerKm: g, label: transport, kind: "mode" }
+  return {}
 }
 
killedBy: getEmissionFactor non-car transport modes returns 0 g/km for foot
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/emissions.js:45:84
  *             gramsPerTrip: number, totalGrams: number, totalKg: number }}
  * @throws {Error} on invalid inputs
  */
-export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
-  if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
-    throw new Error("distanceKm must be a positive finite number")
-  }
-  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
-    throw new Error("frequency must be a positive integer")
-  }
-
-  const { gPerKm, label, kind } = getEmissionFactor(transport, carModel)
-  const gramsPerTrip = distanceKm * gPerKm
-  const totalGrams = gramsPerTrip * frequency
-  const totalKg = totalGrams / GRAMS_PER_KG
-
-  return { gPerKm, label, kind, gramsPerTrip, totalGrams, totalKg }
-}
+export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {}
 
killedBy: calculateEmissions distance × g/km multiplication calculates gramsPerTrip correctly for bus
statusReason: Cannot read properties of undefined (reading 'gramsPerTrip')

[Killed] EqualityOperator
src/lib/emissions.js:46:39
  * @throws {Error} on invalid inputs
  */
 export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
-  if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
+  if (!Number.isFinite(distanceKm) || distanceKm < 0) {
     throw new Error("distanceKm must be a positive finite number")
   }
killedBy: calculateEmissions invalid inputs throws when distanceKm is 0
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/emissions.js:46:39
  * @throws {Error} on invalid inputs
  */
 export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
-  if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
+  if (!Number.isFinite(distanceKm) || distanceKm > 0) {
     throw new Error("distanceKm must be a positive finite number")
   }
killedBy: calculateEmissions distance × g/km multiplication calculates gramsPerTrip correctly for bus
statusReason: distanceKm must be a positive finite number

[Killed] StringLiteral
src/lib/emissions.js:47:21
  */
 export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
   if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
-    throw new Error("distanceKm must be a positive finite number")
+    throw new Error("")
   }
   if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
killedBy: calculateEmissions invalid inputs throws when distanceKm is 0
statusReason: expected [Function] to throw error including 'distanceKm' but got ''

[Killed] BlockStatement
src/lib/emissions.js:49:86
   if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
     throw new Error("distanceKm must be a positive finite number")
   }
-  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
-    throw new Error("frequency must be a positive integer")
-  }
+  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {}
 
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel)
killedBy: calculateEmissions invalid inputs throws when frequency is 0
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/lib/emissions.js:49:7
   if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
     throw new Error("distanceKm must be a positive finite number")
   }
-  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
+  if (!Number.isFinite(frequency) && frequency <= 0 || !Number.isInteger(frequency)) {
     throw new Error("frequency must be a positive integer")
   }
killedBy: calculateEmissions invalid inputs throws when frequency is 0
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/lib/emissions.js:54:24
   }
 
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel)
-  const gramsPerTrip = distanceKm * gPerKm
+  const gramsPerTrip = distanceKm / gPerKm
   const totalGrams = gramsPerTrip * frequency
   const totalKg = totalGrams / GRAMS_PER_KG
killedBy: calculateEmissions distance × g/km multiplication calculates gramsPerTrip correctly for bus
statusReason: expected 0.09523809523809523 to be 1050 // Object.is equality

[Killed] ArithmeticOperator
src/lib/emissions.js:55:22
 
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel)
   const gramsPerTrip = distanceKm * gPerKm
-  const totalGrams = gramsPerTrip * frequency
+  const totalGrams = gramsPerTrip / frequency
   const totalKg = totalGrams / GRAMS_PER_KG
 
killedBy: calculateEmissions total emissions (gramsPerTrip × frequency) multiplies correctly for multiple trips — bus
statusReason: expected 262.5 to be 4200 // Object.is equality

[Killed] ArithmeticOperator
src/lib/emissions.js:56:19
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel)
   const gramsPerTrip = distanceKm * gPerKm
   const totalGrams = gramsPerTrip * frequency
-  const totalKg = totalGrams / GRAMS_PER_KG
+  const totalKg = totalGrams * GRAMS_PER_KG
 
   return { gPerKm, label, kind, gramsPerTrip, totalGrams, totalKg }
killedBy: calculateEmissions total emissions (gramsPerTrip × frequency) multiplies correctly for multiple trips — bus
statusReason: expected 4200000 to be close to 4.2, received difference is 4199995.8, but expected 0.000005
