[Killed] ArrayDeclaration
src/data/data.js:19:34
 
 // ─── Exports ──────────────────────────────────────────────────────────────────
 
-export const TRANSPORT_OPTIONS = [
-  { value: "foot",  label: "Foot"  },
-  { value: "bike",  label: "Bike"  },
-  { value: "car",   label: "Car"   },
-  { value: "bus",   label: "Bus"   },
-  { value: "train", label: "Train" },
-  { value: "tram",  label: "Tram"  },
-  { value: "metro", label: "Metro" },
-  { value: "ferry", label: "Ferry" },
-]
+export const TRANSPORT_OPTIONS = []
 
 export const TRANSPORT_G_PER_KM = {
killedBy: TRANSPORT_OPTIONS contains exactly 8 transport options
statusReason: expected [] to have a length of 8 but got +0

[Killed] StringLiteral
src/data/data.js:20:12
 // ─── Exports ──────────────────────────────────────────────────────────────────
 
 export const TRANSPORT_OPTIONS = [
-  { value: "foot",  label: "Foot"  },
+  { value: "",  label: "Foot"  },
   { value: "bike",  label: "Bike"  },
   { value: "car",   label: "Car"   },
killedBy: data integrity all TRANSPORT_OPTIONS values are either in TRANSPORT_G_PER_KM or are 'car'
statusReason: has no emission factor: expected false to be true // Object.is equality

[Killed] StringLiteral
src/data/data.js:21:12
 
 export const TRANSPORT_OPTIONS = [
   { value: "foot",  label: "Foot"  },
-  { value: "bike",  label: "Bike"  },
+  { value: "",  label: "Bike"  },
   { value: "car",   label: "Car"   },
   { value: "bus",   label: "Bus"   },
killedBy: TRANSPORT_OPTIONS entry 'bike' has label ''Bike''
statusReason: Missing option for value="bike": expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:23:12
   { value: "foot",  label: "Foot"  },
   { value: "bike",  label: "Bike"  },
   { value: "car",   label: "Car"   },
-  { value: "bus",   label: "Bus"   },
+  { value: "",   label: "Bus"   },
   { value: "train", label: "Train" },
   { value: "tram",  label: "Tram"  },
killedBy: TRANSPORT_OPTIONS entry 'bus' has label ''Bus''
statusReason: Missing option for value="bus": expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:25:28
   { value: "car",   label: "Car"   },
   { value: "bus",   label: "Bus"   },
   { value: "train", label: "Train" },
-  { value: "tram",  label: "Tram"  },
+  { value: "tram",  label: ""  },
   { value: "metro", label: "Metro" },
   { value: "ferry", label: "Ferry" },
killedBy: TRANSPORT_OPTIONS entry 'tram' has label ''Tram''
statusReason: expected '' to be 'Tram' // Object.is equality

[Killed] StringLiteral
src/data/data.js:25:12
   { value: "car",   label: "Car"   },
   { value: "bus",   label: "Bus"   },
   { value: "train", label: "Train" },
-  { value: "tram",  label: "Tram"  },
+  { value: "",  label: "Tram"  },
   { value: "metro", label: "Metro" },
   { value: "ferry", label: "Ferry" },
killedBy: TRANSPORT_OPTIONS entry 'tram' has label ''Tram''
statusReason: Missing option for value="tram": expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:26:12
   { value: "bus",   label: "Bus"   },
   { value: "train", label: "Train" },
   { value: "tram",  label: "Tram"  },
-  { value: "metro", label: "Metro" },
+  { value: "", label: "Metro" },
   { value: "ferry", label: "Ferry" },
 ]
killedBy: TRANSPORT_OPTIONS entry 'metro' has label ''Metro''
statusReason: Missing option for value="metro": expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:27:12
   { value: "train", label: "Train" },
   { value: "tram",  label: "Tram"  },
   { value: "metro", label: "Metro" },
-  { value: "ferry", label: "Ferry" },
+  { value: "", label: "Ferry" },
 ]
 
killedBy: TRANSPORT_OPTIONS entry 'ferry' has label ''Ferry''
statusReason: Missing option for value="ferry": expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:41:3
 }
 
 export const CAR_MODELS = [
-  { model: "Volkswagen Golf", gCo2PerKm: 180 },
+  {},
   { model: "Ford Focus",      gCo2PerKm: 175 },
   { model: "Honda Civic",     gCo2PerKm: 170 },
killedBy: CAR_MODELS 'Volkswagen Golf' emits 180 g/km
statusReason: Missing car model: Volkswagen Golf: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:41:12
 }
 
 export const CAR_MODELS = [
-  { model: "Volkswagen Golf", gCo2PerKm: 180 },
+  { model: "", gCo2PerKm: 180 },
   { model: "Ford Focus",      gCo2PerKm: 175 },
   { model: "Honda Civic",     gCo2PerKm: 170 },
killedBy: CAR_MODELS 'Volkswagen Golf' emits 180 g/km
statusReason: Missing car model: Volkswagen Golf: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:42:12
 
 export const CAR_MODELS = [
   { model: "Volkswagen Golf", gCo2PerKm: 180 },
-  { model: "Ford Focus",      gCo2PerKm: 175 },
+  { model: "",      gCo2PerKm: 175 },
   { model: "Honda Civic",     gCo2PerKm: 170 },
   { model: "Hyundai i30",     gCo2PerKm: 172 },
killedBy: CAR_MODELS 'Ford Focus' emits 175 g/km
statusReason: Missing car model: Ford Focus: expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:45:3
   { model: "Ford Focus",      gCo2PerKm: 175 },
   { model: "Honda Civic",     gCo2PerKm: 170 },
   { model: "Hyundai i30",     gCo2PerKm: 172 },
-  { model: "Kia Ceed",        gCo2PerKm: 168 },
+  {},
   { model: "Renault Megane",  gCo2PerKm: 160 },
   { model: "Peugeot 308",     gCo2PerKm: 158 },
killedBy: CAR_MODELS 'Kia Ceed' emits 168 g/km
statusReason: Missing car model: Kia Ceed: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:47:12
   { model: "Hyundai i30",     gCo2PerKm: 172 },
   { model: "Kia Ceed",        gCo2PerKm: 168 },
   { model: "Renault Megane",  gCo2PerKm: 160 },
-  { model: "Peugeot 308",     gCo2PerKm: 158 },
+  { model: "",     gCo2PerKm: 158 },
   { model: "Skoda Octavia",   gCo2PerKm: 182 },
   { model: "Opel Astra",      gCo2PerKm: 169 },
killedBy: CAR_MODELS 'Peugeot 308' emits 158 g/km
statusReason: Missing car model: Peugeot 308: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:48:12
   { model: "Kia Ceed",        gCo2PerKm: 168 },
   { model: "Renault Megane",  gCo2PerKm: 160 },
   { model: "Peugeot 308",     gCo2PerKm: 158 },
-  { model: "Skoda Octavia",   gCo2PerKm: 182 },
+  { model: "",   gCo2PerKm: 182 },
   { model: "Opel Astra",      gCo2PerKm: 169 },
   { model: "BMW 320i",        gCo2PerKm: 210 },
killedBy: CAR_MODELS 'Skoda Octavia' emits 182 g/km
statusReason: Missing car model: Skoda Octavia: expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:49:3
   { model: "Renault Megane",  gCo2PerKm: 160 },
   { model: "Peugeot 308",     gCo2PerKm: 158 },
   { model: "Skoda Octavia",   gCo2PerKm: 182 },
-  { model: "Opel Astra",      gCo2PerKm: 169 },
+  {},
   { model: "BMW 320i",        gCo2PerKm: 210 },
   { model: "Mercedes C 220",  gCo2PerKm: 205 },
killedBy: CAR_MODELS 'Opel Astra' emits 169 g/km
statusReason: Missing car model: Opel Astra: expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:50:3
   { model: "Peugeot 308",     gCo2PerKm: 158 },
   { model: "Skoda Octavia",   gCo2PerKm: 182 },
   { model: "Opel Astra",      gCo2PerKm: 169 },
-  { model: "BMW 320i",        gCo2PerKm: 210 },
+  {},
   { model: "Mercedes C 220",  gCo2PerKm: 205 },
   { model: "Tesla Model 3",   gCo2PerKm: 0   },
killedBy: CAR_MODELS 'BMW 320i' emits 210 g/km
statusReason: Missing car model: BMW 320i: expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:51:3
   { model: "Skoda Octavia",   gCo2PerKm: 182 },
   { model: "Opel Astra",      gCo2PerKm: 169 },
   { model: "BMW 320i",        gCo2PerKm: 210 },
-  { model: "Mercedes C 220",  gCo2PerKm: 205 },
+  {},
   { model: "Tesla Model 3",   gCo2PerKm: 0   },
 ]
killedBy: CAR_MODELS 'Mercedes C 220' emits 205 g/km
statusReason: Missing car model: Mercedes C 220: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:51:12
   { model: "Skoda Octavia",   gCo2PerKm: 182 },
   { model: "Opel Astra",      gCo2PerKm: 169 },
   { model: "BMW 320i",        gCo2PerKm: 210 },
-  { model: "Mercedes C 220",  gCo2PerKm: 205 },
+  { model: "",  gCo2PerKm: 205 },
   { model: "Tesla Model 3",   gCo2PerKm: 0   },
 ]
killedBy: CAR_MODELS 'Mercedes C 220' emits 205 g/km
statusReason: Missing car model: Mercedes C 220: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:52:12
   { model: "Opel Astra",      gCo2PerKm: 169 },
   { model: "BMW 320i",        gCo2PerKm: 210 },
   { model: "Mercedes C 220",  gCo2PerKm: 205 },
-  { model: "Tesla Model 3",   gCo2PerKm: 0   },
+  { model: "",   gCo2PerKm: 0   },
 ]
 
killedBy: CAR_MODELS 'Tesla Model 3' emits +0 g/km
statusReason: Missing car model: Tesla Model 3: expected undefined to be defined
