[Killed] BlockStatement
src/lib/emissions.js:12:63
  * @returns {{ gPerKm: number, label: string, kind: "carModel"|"mode" }}
  * @throws {Error} if transport is unknown or carModel is not found
  */
-export function getEmissionFactor(transport, carModel = null) {
-  if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car");
-    const row = CAR_MODELS.find((c) => c.model === carModel);
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`);
-    return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
-  }
-
-  if (!(transport in TRANSPORT_G_PER_KM)) {
-    throw new Error(`Unknown transport mode: "${transport}"`);
-  }
-
-  const g = TRANSPORT_G_PER_KM[transport];
-  return { gPerKm: g, label: transport, kind: "mode" };
-}
+export function getEmissionFactor(transport, carModel = null) {}
 
 /**
killedBy: getEmissionFactor non-car transport modes returns 0 g/km for foot
statusReason: Cannot read properties of undefined (reading 'gPerKm')

[Killed] ConditionalExpression
src/lib/emissions.js:13:7
  * @throws {Error} if transport is unknown or carModel is not found
  */
 export function getEmissionFactor(transport, carModel = null) {
-  if (transport === "car") {
+  if (false) {
     if (!carModel) throw new Error("carModel is required when transport is car");
     const row = CAR_MODELS.find((c) => c.model === carModel);
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown transport mode: "car"

[Killed] ConditionalExpression
src/lib/emissions.js:14:9
  */
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car");
+    if (true) throw new Error("carModel is required when transport is car");
     const row = CAR_MODELS.find((c) => c.model === carModel);
     if (!row) throw new Error(`Unknown car model: "${carModel}"`);
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: carModel is required when transport is car

[Killed] ConditionalExpression
src/lib/emissions.js:14:9
  */
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
-    if (!carModel) throw new Error("carModel is required when transport is car");
+    if (false) throw new Error("carModel is required when transport is car");
     const row = CAR_MODELS.find((c) => c.model === carModel);
     if (!row) throw new Error(`Unknown car model: "${carModel}"`);
killedBy: getEmissionFactor invalid inputs throws when transport is car but no carModel given
statusReason: expected [Function] to throw error including 'carModel is required' but got 'Unknown car model: "null"'

[Killed] ConditionalExpression
src/lib/emissions.js:15:40
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car");
-    const row = CAR_MODELS.find((c) => c.model === carModel);
+    const row = CAR_MODELS.find((c) => false);
     if (!row) throw new Error(`Unknown car model: "${carModel}"`);
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown car model: "Volkswagen Golf"

[Killed] EqualityOperator
src/lib/emissions.js:15:40
 export function getEmissionFactor(transport, carModel = null) {
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car");
-    const row = CAR_MODELS.find((c) => c.model === carModel);
+    const row = CAR_MODELS.find((c) => c.model !== carModel);
     if (!row) throw new Error(`Unknown car model: "${carModel}"`);
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: expected 175 to be 180 // Object.is equality

[Killed] BooleanLiteral
src/lib/emissions.js:16:9
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car");
     const row = CAR_MODELS.find((c) => c.model === carModel);
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`);
+    if (row) throw new Error(`Unknown car model: "${carModel}"`);
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
   }
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: Unknown car model: "Volkswagen Golf"

[Killed] ConditionalExpression
src/lib/emissions.js:16:9
   if (transport === "car") {
     if (!carModel) throw new Error("carModel is required when transport is car");
     const row = CAR_MODELS.find((c) => c.model === carModel);
-    if (!row) throw new Error(`Unknown car model: "${carModel}"`);
+    if (false) throw new Error(`Unknown car model: "${carModel}"`);
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
   }
killedBy: getEmissionFactor invalid inputs throws when carModel name does not exist
statusReason: expected [Function] to throw error including 'Unknown car model: "Ferrari Enzo"' but got 'Cannot read properties of undefined (…'

[Killed] ObjectLiteral
src/lib/emissions.js:17:12
     if (!carModel) throw new Error("carModel is required when transport is car");
     const row = CAR_MODELS.find((c) => c.model === carModel);
     if (!row) throw new Error(`Unknown car model: "${carModel}"`);
-    return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
+    return {};
   }
 
killedBy: getEmissionFactor car transport — all WLTP models returns correct gPerKm for 'Volkswagen Golf'
statusReason: expected undefined to be 180 // Object.is equality

[Killed] ConditionalExpression
src/lib/emissions.js:20:7
     return { gPerKm: row.gCo2PerKm, label: row.model, kind: "carModel" };
   }
 
-  if (!(transport in TRANSPORT_G_PER_KM)) {
+  if (false) {
     throw new Error(`Unknown transport mode: "${transport}"`);
   }
killedBy: getEmissionFactor invalid inputs throws on unknown transport mode
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/emissions.js:40:84
  *             gramsPerTrip: number, totalGrams: number, totalKg: number }}
  * @throws {Error} on invalid inputs
  */
-export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
-  if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
-    throw new Error("distanceKm must be a positive finite number");
-  }
-  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
-    throw new Error("frequency must be a positive integer");
-  }
-
-  const { gPerKm, label, kind } = getEmissionFactor(transport, carModel);
-  const gramsPerTrip = distanceKm * gPerKm;
-  const totalGrams = gramsPerTrip * frequency;
-  const totalKg = totalGrams / 1000;
-
-  return { gPerKm, label, kind, gramsPerTrip, totalGrams, totalKg };
-}
+export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {}
 
killedBy: calculateEmissions distance × g/km multiplication calculates gramsPerTrip correctly for bus
statusReason: Cannot read properties of undefined (reading 'gramsPerTrip')

[Killed] LogicalOperator
src/lib/emissions.js:41:7
  * @throws {Error} on invalid inputs
  */
 export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
-  if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
+  if (!Number.isFinite(distanceKm) && distanceKm <= 0) {
     throw new Error("distanceKm must be a positive finite number");
   }
killedBy: calculateEmissions invalid inputs throws when distanceKm is 0
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/emissions.js:41:7
  * @throws {Error} on invalid inputs
  */
 export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
-  if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
+  if (true) {
     throw new Error("distanceKm must be a positive finite number");
   }
killedBy: calculateEmissions distance × g/km multiplication calculates gramsPerTrip correctly for bus
statusReason: distanceKm must be a positive finite number

[Killed] StringLiteral
src/lib/emissions.js:42:21
  */
 export function calculateEmissions({ transport, carModel, distanceKm, frequency }) {
   if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
-    throw new Error("distanceKm must be a positive finite number");
+    throw new Error("");
   }
   if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
killedBy: calculateEmissions invalid inputs throws when distanceKm is 0
statusReason: expected [Function] to throw error including 'distanceKm' but got ''

[Killed] ConditionalExpression
src/lib/emissions.js:44:38
   if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
     throw new Error("distanceKm must be a positive finite number");
   }
-  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
+  if (!Number.isFinite(frequency) || false || !Number.isInteger(frequency)) {
     throw new Error("frequency must be a positive integer");
   }
killedBy: calculateEmissions invalid inputs throws when frequency is 0
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/lib/emissions.js:44:7
   if (!Number.isFinite(distanceKm) || distanceKm <= 0) {
     throw new Error("distanceKm must be a positive finite number");
   }
-  if (!Number.isFinite(frequency) || frequency <= 0 || !Number.isInteger(frequency)) {
+  if ((!Number.isFinite(frequency) || frequency <= 0) && !Number.isInteger(frequency)) {
     throw new Error("frequency must be a positive integer");
   }
killedBy: calculateEmissions invalid inputs throws when frequency is 0
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/lib/emissions.js:49:24
   }
 
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel);
-  const gramsPerTrip = distanceKm * gPerKm;
+  const gramsPerTrip = distanceKm / gPerKm;
   const totalGrams = gramsPerTrip * frequency;
   const totalKg = totalGrams / 1000;
killedBy: calculateEmissions distance × g/km multiplication calculates gramsPerTrip correctly for bus
statusReason: expected 0.09523809523809523 to be 1050 // Object.is equality

[Killed] ArithmeticOperator
src/lib/emissions.js:50:22
 
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel);
   const gramsPerTrip = distanceKm * gPerKm;
-  const totalGrams = gramsPerTrip * frequency;
+  const totalGrams = gramsPerTrip / frequency;
   const totalKg = totalGrams / 1000;
 
killedBy: calculateEmissions total emissions (gramsPerTrip × frequency) multiplies correctly for multiple trips — bus
statusReason: expected 262.5 to be 4200 // Object.is equality

[Killed] ArithmeticOperator
src/lib/emissions.js:51:19
   const { gPerKm, label, kind } = getEmissionFactor(transport, carModel);
   const gramsPerTrip = distanceKm * gPerKm;
   const totalGrams = gramsPerTrip * frequency;
-  const totalKg = totalGrams / 1000;
+  const totalKg = totalGrams * 1000;
 
   return { gPerKm, label, kind, gramsPerTrip, totalGrams, totalKg };
killedBy: calculateEmissions total emissions (gramsPerTrip × frequency) multiplies correctly for multiple trips — bus
statusReason: expected 4200000 to be close to 4.2, received difference is 4199995.8, but expected 0.000005
