[Killed] ArrayDeclaration
src/data/data.js:1:34
-export const TRANSPORT_OPTIONS = [
-  { value: "foot", label: "Foot" },
-  { value: "bike", label: "Bike" },
-  { value: "car", label: "Car" },
-  { value: "bus", label: "Bus" },
-  { value: "train", label: "Train" },
-  { value: "tram", label: "Tram" },
-  { value: "metro", label: "Metro" },
-  { value: "ferry", label: "Ferry" },
-];
+export const TRANSPORT_OPTIONS = [];
 
 export const TRANSPORT_G_PER_KM = {
killedBy: TRANSPORT_OPTIONS contains exactly 8 transport options
statusReason: expected [] to have a length of 8 but got +0

[Killed] ObjectLiteral
src/data/data.js:2:3
 export const TRANSPORT_OPTIONS = [
-  { value: "foot", label: "Foot" },
+  {},
   { value: "bike", label: "Bike" },
   { value: "car", label: "Car" },
killedBy: data integrity all TRANSPORT_OPTIONS values are either in TRANSPORT_G_PER_KM or are 'car'
statusReason: undefined has no emission factor: expected false to be true // Object.is equality

[Killed] StringLiteral
src/data/data.js:2:27
 export const TRANSPORT_OPTIONS = [
-  { value: "foot", label: "Foot" },
+  { value: "foot", label: "" },
   { value: "bike", label: "Bike" },
   { value: "car", label: "Car" },
killedBy: TRANSPORT_OPTIONS entry 'foot' has label ''Foot''
statusReason: expected '' to be 'Foot' // Object.is equality

[Killed] StringLiteral
src/data/data.js:3:27
 export const TRANSPORT_OPTIONS = [
   { value: "foot", label: "Foot" },
-  { value: "bike", label: "Bike" },
+  { value: "bike", label: "" },
   { value: "car", label: "Car" },
   { value: "bus", label: "Bus" },
killedBy: TRANSPORT_OPTIONS entry 'bike' has label ''Bike''
statusReason: expected '' to be 'Bike' // Object.is equality

[Killed] StringLiteral
src/data/data.js:4:12
 export const TRANSPORT_OPTIONS = [
   { value: "foot", label: "Foot" },
   { value: "bike", label: "Bike" },
-  { value: "car", label: "Car" },
+  { value: "", label: "Car" },
   { value: "bus", label: "Bus" },
   { value: "train", label: "Train" },
killedBy: data integrity all TRANSPORT_OPTIONS values are either in TRANSPORT_G_PER_KM or are 'car'
statusReason: has no emission factor: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/data/data.js:4:3
 export const TRANSPORT_OPTIONS = [
   { value: "foot", label: "Foot" },
   { value: "bike", label: "Bike" },
-  { value: "car", label: "Car" },
+  {},
   { value: "bus", label: "Bus" },
   { value: "train", label: "Train" },
killedBy: data integrity all TRANSPORT_OPTIONS values are either in TRANSPORT_G_PER_KM or are 'car'
statusReason: undefined has no emission factor: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/data/data.js:5:3
   { value: "foot", label: "Foot" },
   { value: "bike", label: "Bike" },
   { value: "car", label: "Car" },
-  { value: "bus", label: "Bus" },
+  {},
   { value: "train", label: "Train" },
   { value: "tram", label: "Tram" },
killedBy: TRANSPORT_OPTIONS entry 'bus' has label ''Bus''
statusReason: Missing option for value="bus": expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:6:12
   { value: "bike", label: "Bike" },
   { value: "car", label: "Car" },
   { value: "bus", label: "Bus" },
-  { value: "train", label: "Train" },
+  { value: "", label: "Train" },
   { value: "tram", label: "Tram" },
   { value: "metro", label: "Metro" },
killedBy: TRANSPORT_OPTIONS entry 'train' has label ''Train''
statusReason: Missing option for value="train": expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:8:3
   { value: "bus", label: "Bus" },
   { value: "train", label: "Train" },
   { value: "tram", label: "Tram" },
-  { value: "metro", label: "Metro" },
+  {},
   { value: "ferry", label: "Ferry" },
 ];
killedBy: TRANSPORT_OPTIONS entry 'metro' has label ''Metro''
statusReason: Missing option for value="metro": expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:9:3
   { value: "train", label: "Train" },
   { value: "tram", label: "Tram" },
   { value: "metro", label: "Metro" },
-  { value: "ferry", label: "Ferry" },
+  {},
 ];
 
killedBy: data integrity all TRANSPORT_OPTIONS values are either in TRANSPORT_G_PER_KM or are 'car'
statusReason: undefined has no emission factor: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/data/data.js:12:35
   { value: "ferry", label: "Ferry" },
 ];
 
-export const TRANSPORT_G_PER_KM = {
-  foot: 0,
-  bike: 0,
-  bus: 105,
-  train: 60,
-  tram: 45,
-  metro: 50,
-  ferry: 120,
-};
+export const TRANSPORT_G_PER_KM = {};
 
 export const CAR_MODELS = [
killedBy: TRANSPORT_G_PER_KM foot emits 0 g/km
statusReason: expected undefined to be +0 // Object.is equality

[Killed] StringLiteral
src/data/data.js:25:12
 export const CAR_MODELS = [
   { model: "Volkswagen Golf", gCo2PerKm: 180 },
   { model: "Ford Focus", gCo2PerKm: 175 },
-  { model: "Honda Civic", gCo2PerKm: 170 },
+  { model: "", gCo2PerKm: 170 },
   { model: "Hyundai i30", gCo2PerKm: 172 },
   { model: "Kia Ceed", gCo2PerKm: 168 },
statusReason: carModel is required when transport is car

[Killed] StringLiteral
src/data/data.js:26:12
   { model: "Volkswagen Golf", gCo2PerKm: 180 },
   { model: "Ford Focus", gCo2PerKm: 175 },
   { model: "Honda Civic", gCo2PerKm: 170 },
-  { model: "Hyundai i30", gCo2PerKm: 172 },
+  { model: "", gCo2PerKm: 172 },
   { model: "Kia Ceed", gCo2PerKm: 168 },
   { model: "Renault Megane", gCo2PerKm: 160 },
killedBy: CAR_MODELS 'Hyundai i30' emits 172 g/km
statusReason: Missing car model: Hyundai i30: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:27:12
   { model: "Ford Focus", gCo2PerKm: 175 },
   { model: "Honda Civic", gCo2PerKm: 170 },
   { model: "Hyundai i30", gCo2PerKm: 172 },
-  { model: "Kia Ceed", gCo2PerKm: 168 },
+  { model: "", gCo2PerKm: 168 },
   { model: "Renault Megane", gCo2PerKm: 160 },
   { model: "Peugeot 308", gCo2PerKm: 158 },
statusReason: carModel is required when transport is car

[Killed] ObjectLiteral
src/data/data.js:28:3
   { model: "Honda Civic", gCo2PerKm: 170 },
   { model: "Hyundai i30", gCo2PerKm: 172 },
   { model: "Kia Ceed", gCo2PerKm: 168 },
-  { model: "Renault Megane", gCo2PerKm: 160 },
+  {},
   { model: "Peugeot 308", gCo2PerKm: 158 },
   { model: "Skoda Octavia", gCo2PerKm: 182 },
killedBy: CAR_MODELS 'Renault Megane' emits 160 g/km
statusReason: Missing car model: Renault Megane: expected undefined to be defined

[Killed] StringLiteral
src/data/data.js:31:12
   { model: "Renault Megane", gCo2PerKm: 160 },
   { model: "Peugeot 308", gCo2PerKm: 158 },
   { model: "Skoda Octavia", gCo2PerKm: 182 },
-  { model: "Opel Astra", gCo2PerKm: 169 },
+  { model: "", gCo2PerKm: 169 },
   { model: "BMW 320i", gCo2PerKm: 210 },
   { model: "Mercedes C 220", gCo2PerKm: 205 },
killedBy: CAR_MODELS 'Opel Astra' emits 169 g/km
statusReason: Missing car model: Opel Astra: expected undefined to be defined

[Killed] ObjectLiteral
src/data/data.js:34:3
   { model: "Opel Astra", gCo2PerKm: 169 },
   { model: "BMW 320i", gCo2PerKm: 210 },
   { model: "Mercedes C 220", gCo2PerKm: 205 },
-  { model: "Tesla Model 3", gCo2PerKm: 0 },
+  {},
 ];
 
statusReason: carModel is required when transport is car
